tap 'homebrew/bundle'

brew 'autoconf'
brew 'cmake'
brew 'fontconfig'
brew 'fontforge'
brew 'freetype'
brew 'gbdm'
brew 'gettext'
brew 'git'
brew 'openssl'
brew 'python'
brew 'rbenv'
brew 'ruby-build'
brew 'sqlite'
brew 'tig'
brew 'tmux'
