tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications"

# 'brew install'
brew "autoconf", link: false
brew "autossh", link: false
brew "ca-certificates"
brew "gdbm", link: false
brew "gettext", link: false
brew "libffi"
brew "pcre", link: false
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "xz", link: false
brew "glib", link: false
brew "pixman", link: false
brew "pkg-config", link: false
brew "cairo", link: false
brew "cmake", link: false
brew "libssh2", link: false
brew "curl", args: ["with-libssh2"]
brew "libsodium", link: false
brew "zeromq", link: false
brew "czmq", link: false
brew "gobject-introspection", link: false
brew "icu4c"
brew "harfbuzz", link: false
brew "jpeg", link: false
brew "libtiff", link: false
brew "libtool", link: false
brew "pango", link: false
brew "fontforge", link: false
brew "jbig2dec", link: false
brew "little-cms2", link: false
brew "ghostscript", link: false
brew "git", link: false
brew "git-ftp", link: false
brew "hugo"
brew "imagemagick", link: false
brew "libevent", link: false
brew "libyaml", link: false
brew "lua", link: false
brew "mas", link: false
brew "macvim"
brew "pandoc", link: false
brew "python", link: false
brew "reattach-to-user-namespace", link: false
brew "tig", link: false
brew "tmux", link: false
brew "wget", link: false
brew "xpdf"
brew "zsh", link: false

# 'brew install --cask'
cask "adobe-digital-editions"
cask "alfred"
cask "authy"
cask "brave-browser"
cask "calibre"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
# cask "mactex" -> manual install
cask "obs"
cask "skim"
cask "spotify"
cask "todoist"
cask "toggl-track"
cask "vlc"
cask "webex-meetings"
cask "zoom"
cask "zotero"



