tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications"

# 'brew install'
brew "autoconf"
brew "autossh"
brew "ca-certificates"
brew "cairo"
brew "cmake"
brew "curl", args: ["with-libssh2"]
brew "czmq"
brew "deno"
brew "fontforge"
brew "gdbm"
brew "gettext"
brew "ghostscript"
brew "git"
brew "git-ftp"
brew "glib"
brew "gobject-introspection"
brew "gnupg"
brew "harfbuzz"
brew "hugo"
brew "icu4c"
brew "imagemagick"
brew "jbig2dec"
brew "jpeg"
brew "libevent"
brew "libffi"
brew "libsodium"
brew "libssh2"
brew "libtiff"
brew "libtool"
brew "libyaml"
brew "little-cms2"
brew "lua"
brew "mas"
brew "nodebrew"
brew "openssl@3"
brew "pandoc"
brew "pango"
brew "pcre"
brew "pixman"
brew "pkg-config"
brew "python"
brew "readline"
brew "reattach-to-user-namespace"
brew "sqlite"
brew "terminal-notifier"
brew "texlab"
brew "tig"
brew "tmux"
brew "wget"
brew "xpdf"
brew "xz"
brew "zeromq"
brew "zsh"

# 'brew install --cask'
cask "adobe-acrobat-reader"
cask "adobe-digital-editions"
cask "alfred"
cask "authy"
cask "brave-browser"
cask "calibre"
cask "clipy"
cask "google-chrome"
cask "google-japanese-ime"
cask "iterm2"
cask "mactex"
cask "macvim"
cask "obs"
cask "skim"
cask "spotify"
cask "todoist"
cask "toggl-track"
cask "vlc"
cask "webex-meetings"
cask "zoom"
cask "zotero"

# 'mas install'
mas "RunCat", id: 1429033973
mas "Sensible Paster", id: 1553906835
