tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# set arguments for all 'brew install --cask' commands
cask_args appdir: "/Applications"

# 'brew install'
brew "adobe-acrobat-reader"
brew "adobe-digital-editions"
brew "alfred"
brew "autoconf"
brew "autossh"
brew "brave-browser"
brew "ca-certificates"
brew "cairo"
brew "calibre"
brew "clipy"
brew "cmake"
brew "curl", args: ["with-libssh2"]
brew "czmq"
brew "deno"
brew "fontforge"
brew "gdbm"
brew "gettext"
brew "ghostscript"
brew "git"
brew "git-ftp"
brew "glib"
brew "gobject-introspection"
brew "google-chrome"
brew "google-japanese-ime"
brew "gnupg"
brew "harfbuzz"
brew "hugo"
brew "icu4c"
brew "imagemagick"
brew "iterm2"
brew "jbig2dec"
brew "jpeg"
brew "libevent"
brew "libffi"
brew "libsodium"
brew "libssh2"
brew "libtiff"
brew "libtool"
brew "libyaml"
brew "little-cms2"
brew "lua"
brew "mactex"
brew "macvim"
brew "mas"
brew "nodebrew"
brew "obs"
brew "openssl@3"
brew "pandoc"
brew "pango"
brew "pcre"
brew "pixman"
brew "pkg-config"
brew "python"
brew "readline"
brew "reattach-to-user-namespace"
brew "skim"
brew "spotify"
brew "sqlite"
brew "terminal-notifier"
brew "texlab"
brew "tig"
brew "todoist"
brew "toggl-track"
brew "tmux"
brew "vlc"
brew "wget"
brew "xpdf"
brew "xz"
brew "zeromq"
brew "zoom"
brew "zotero"
brew "zsh"

# 'mas install'
mas "RunCat", id: 1429033973
mas "Sensible Paster", id: 1553906835
mas "辞書 by 物書堂", id: 1380563956
